# WorksetKindFilter Constructor (WorksetKind) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetKindFilter Constructor (WorksetKind)
WorksetKindFilter Class See Also
---
Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public WorksetKindFilter(
	WorksetKind worksetKind
)
```

Visual Basic
---
```text
Public Sub New ( _
	worksetKind As WorksetKind _
)
```

Visual C++
---
```text
public:
WorksetKindFilter(
	WorksetKind worksetKind
)
```

# ### Parameters
worksetKind
    Type: Autodesk.Revit.DB..::..WorksetKind The WorksetKind to match.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
WorksetKindFilter Class
WorksetKindFilter Overload
Autodesk.Revit.DB Namespace